# SquareMetersPerSecond Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..SquareMetersPerSecond Property
UnitTypeId Class See Also
---
Square meters per second.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId SquareMetersPerSecond { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SquareMetersPerSecond As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SquareMetersPerSecond {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace